Revit 2027 API
BuiltInFailures.StairRampFailures.StairsActualRiserHeightGreaterThanMaximumFailure Property
 Computed actual riser height of stairs is greater than maximum riser height defined in stairs type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsActualRiserHeightGreaterThanMaximumFailure { get; }
Public Shared ReadOnly Property StairsActualRiserHeightGreaterThanMaximumFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsActualRiserHeightGreaterThanMaximumFailure {
	FailureDefinitionId^ get ();
}
static member StairsActualRiserHeightGreaterThanMaximumFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace